[
    {
        "Title": "Depression-Bot-using-RAG",
        "Description": "Geriatric Depression Chatbot",
        "Category": "generative-ai",
        "Industry": "Healthcare",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg?auto=compress&cs=tinysrgb&w=800",
        "Description.1": "A chatbot designed to assist elderly individuals experiencing depression, loneliness, or emotional challenges. Leverages advanced NLP, Langchain, Twilio, and more to offer compassionate, context-aware responses.",
        "Challenge": "Elderly users often face emotional challenges and need empathetic, accessible support that can understand voice, text, and multiple languages.",
        "Solution": "Built a multi-modal chatbot with voice/text input, PDF upload, multi-language support, and negative sentiment detection with Twilio alerts for relatives.",
        "Technologies": "Streamlit', 'Langchain', 'Ollama', 'Chroma', 'Twilio', 'PyPDF2', 'PDFPlumber', 'Deep Translator', 'SpeechRecognition', 'Ragas'",
        "DemoLink": "https://www.youtube.com/watch?v=OnRBqg93EiM"
    },
    {
        "Title": "Intelligent-Fall-Detection-System",
        "Description": "Fall Detection and Emergency Alert System",
        "Category": "computer-vision",
        "Industry": "Healthcare",
        "Thumbnail": "https://i.postimg.cc/NfBVq1Y5/Fall-Thumbnail.jpg",
        "Description.1": "This project combines computer vision and machine learning to create a safety solution that detects falls in real-time and sends emergency alerts to caregivers.",
        "Challenge": "Accidental falls, especially among the elderly, can result in serious injuries or fatalities. Detecting such events quickly is crucial for timely medical intervention.",
        "Solution": "Uses YOLOv8 for real-time fall detection, integrated with face recognition (DeepFace), Twilio API for emergency SMS alerts, and a Streamlit-based admin dashboard for profile management and alerts.",
        "Technologies": "YOLOv8, OpenCV, DeepFace, Streamlit, Python, Twilio API, TensorFlow, scikit-learn",
        "DemoLink": "https://youtu.be/6ox9cFLjzSE"
    },
    {
        "Title": "Smart-Farming-Web-App-Price-Prediction-AI-Chatbot",
        "Description": "AI-Driven Agricultural Web Application",
        "Category": "fullstack-ai",
        "Industry": "Agriculture",
        "Thumbnail": "https://i.postimg.cc/MK99CNdF/Smart-farming.jpg",
        "Description.1": "A full-stack AI-powered farming web application that offers crop price prediction using ML and an AI chatbot assistant to support farmers with real-time decisions.",
        "Challenge": "Farmers often lack real-time insights into market prices and timely support for their agricultural queries, resulting in economic losses and inefficiencies.",
        "Solution": "Implemented a Flask-based backend with REST APIs, a React.js frontend, and a Random Forest ML model for price prediction using crop and market data. Integrated TinyLlama via Ollama for an interactive AI chatbot. Built a secure, responsive, and scalable solution with CI/CD pipeline.",
        "Technologies": "Flask, React.js, Tailwind CSS, scikit-learn, Ollama (TinyLlama), Python, CI/CD",
        "DemoLink": "https://youtu.be/2KSEIYGHyjw"
    },
    {
        "Title": "LungAI-Diagnosis-Assistant  ",
        "Description": "AI-Powered Lung X-ray Diagnosis App",
        "Category": "medical-ai",
        "Industry": "Healthcare ",
        "Thumbnail": "https://i.postimg.cc/zXQnSrd8/lung-ass.jpg",
        "Description.1": "An AI-powered web application that analyzes lung X-ray images to diagnose conditions such as Lung Opacity and Viral Pneumonia with high accuracy and provides AI-generated explanations.  ",
        "Challenge": "Manual analysis of lung X-rays is time-consuming and prone to human error. Non-specialists find it difficult to interpret medical images accurately. ",
        "Solution": "Developed a deep learning-based system using CNN models to predict lung conditions from X-ray images. Integrated AI-generated explanations for patient-friendly insights and built a simple Streamlit UI for ease of use.",
        "Technologies": "TensorFlow, OpenCV, CNN, Streamlit, Python",
        "DemoLink": "https://youtu.be/nWul9A1V8zE"
    },
    {
        "Title": " Interactive Voice Assistant travel agent",
        "Description": "Voice Recognition, Translation & AI-Powered Response App ",
        "Category": "fullstack-ai ",
        "Industry": "General  ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "This innovative app converts spoken queries into text, uses an AI chatbot (TinyLlama) for responses, translates answers into any language, and delivers them back via text-to-speech—all in real-time.",
        "Challenge": "Bridging communication gaps across languages and making AI interactions more natural and accessible through voice.  ",
        "Solution": "A full-stack app using Flask for voice recognition, language translation, and text-to-speech, with a React frontend and integrated TinyLlama chatbot for real-time answers and natural voice feedback.  ",
        "Technologies": "Python, Flask, React, Google Speech Recognition, Google Translate, Text-to-Speech, TinyLlama  ",
        "DemoLink": "https://youtu.be/EepXvKfp7Ow"
    },
    {
        "Title": "AI-Powered-Tamil-Nadu-Tourism-Assistant ",
        "Description": "Interactive Cultural Tourism Web App with AI Features",
        "Category": "fullstack-ai",
        "Industry": "Tourism & Heritage ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A web application that combines Tamil Nadu’s cultural richness with AI-driven features like an interactive heritage map, multilingual chatbot, real-time translation, and voice interface to assist global tourists.",
        "Challenge": "Tourists often struggle with limited access to historical information, language barriers, and navigation while exploring cultural heritage sites.  ",
        "Solution": "Developed a React + Flask-based web app with Ollama’s TinyLlama AI, speech recognition, translation, and text-to-speech to deliver multilingual, voice-interactive assistance for Tamil Nadu's monuments and history. ",
        "Technologies": "React.js, Flask, Python, Ollama AI, Google Translate API, SpeechRecognition, gTTS, Pygame, React-Bootstrap  ",
        "DemoLink": "https://youtu.be/X0Rw_n1MgSk"
    },
    {
        "Title": "Risk-Prediction-and-PDF-Processing-App  ",
        "Description": "AI-Powered Flask API for Risk Prediction and Document Automation",
        "Category": "fullstack-ai",
        "Industry": "HealthTech & Document Processing  ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A robust web app and Flask-based API that handles health risk prediction, image uploads, Excel storage, and PDF text extraction using ML and NLP pipelines powered by LangChain and Llama2. ",
        "Challenge": "Automating complex workflows like risk prediction and document analysis typically requires multiple tools, which can be inefficient for developers and users.  ",
        "Solution": "Built an integrated solution using Flask, OpenCV, Pandas, and PyPDF2 to handle ML-based predictions, secure image/file uploads, and document-based Q&A with LangChain and Ollama’s Llama2 model. ",
        "Technologies": "Flask, Pandas, OpenCV, PyPDF2, LangChain, Ollama, Llama2, Pickle, Flask-CORS, React, Werkzeug  ",
        "DemoLink": "https://youtu.be/ny8u8F3cuak"
    },
    {
        "Title": "SignWave-AI-ASL-Translator  ",
        "Description": "AI-Powered Real-Time Speech-to-Sign Language Translator",
        "Category": "fullstack-ai",
        "Industry": "Accessibility & Education ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "SignWave bridges the communication gap for the deaf community by converting speech into real-time 3D sign language animations using AI and gesture mapping technologies.  ",
        "Challenge": "Communication barriers for the deaf and hard-of-hearing remain a major issue, especially in spontaneous spoken conversations or public content without subtitles.  ",
        "Solution": "Built a Flask-based AI solution that transcribes audio using OpenAI Whisper, then maps text into ASL gestures using MediaPipe and Three.js, allowing both education and real-time sign language translation.  ",
        "Technologies": "Flask, OpenAI Whisper, MediaPipe, NumPy, Three.js, PyTorch, ffmpeg, HTML, CSS, JavaScript, jQuery  ",
        "DemoLink": "https://youtu.be/-FfMy5CDpMc"
    },
    {
        "Title": "Blood Group Classification Using Fingerprint Images",
        "Description": "AI-Powered Deep Learning Model for Blood Group Prediction from Fingerprints  ",
        "Category": "medical-ai ",
        "Industry": "Healthcare & Biometric AI",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "This project uses a deep learning CNN model to classify blood groups based on fingerprint images, integrated into a Streamlit web app for real-time prediction and easy accessibility.",
        "Challenge": "Conventional blood testing methods require invasive procedures; this project explores a non-invasive, image-based classification alternative using fingerprints.",
        "Solution": "Developed an AI system that uses TensorFlow to classify fingerprint images into 8 blood group classes (A+, A-, B+, B-, AB+, AB-, O+, O-), with automatic preprocessing and instant prediction via Streamlit. ",
        "Technologies": "TensorFlow, Keras, CNN, Streamlit, OpenCV, NumPy, Python, PIL, Image Preprocessing  ",
        "DemoLink": "https://youtu.be/UMmAAx3WGKU"
    },
    {
        "Title": "AI-Powered Resume Screening System  ",
        "Description": "Intelligent AI-Based Job Matching Platform for Efficient Hiring",
        "Category": "generative-ai",
        "Industry": "Human Resources & Automation ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "This platform uses Ollama’s TinyLlama AI model to match resumes with job descriptions, automating resume parsing, matching, and cleanup with a seamless React and Flask-based interface.",
        "Challenge": "Manually reviewing resumes is time-consuming and inefficient; traditional systems lack smart, real-time AI evaluation.  ",
        "Solution": "Built an end-to-end system that processes PDFs, extracts data, and intelligently ranks candidates based on job relevance using TinyLlama AI, all through a user-friendly web interface.  ",
        "Technologies": "Flask, React.js, Ollama TinyLlama, PyPDF2, Axios, Flask-CORS, Python ",
        "DemoLink": "https://youtu.be/U2P938WkI9g"
    },
    {
        "Title": "Audio Speech to Sign Language Converter  ",
        "Description": "Live Speech to Indian Sign Language Animation  ",
        "Category": "fullstack-ai ",
        "Industry": "Assistive Technology  ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": " A real-time web application that transforms live audio into Indian Sign Language (ISL) animations using speech recognition, natural language processing, and 3D gesture rendering.",
        "Challenge": "Communication barriers between hearing and deaf communities due to lack of real-time sign language interpretation.  ",
        "Solution": "Developed a system that converts speech and text to ISL animations using Web Speech API, NLTK, and Blender 3D with a Django backend and secure user authentication.",
        "Technologies": "HTML, CSS, JavaScript, Django, Web Speech API, NLTK, Blender 3D ",
        "DemoLink": "https://youtu.be/86E-JcdwPE4"
    },
    {
        "Title": "Face Mask & DeepFake Detection using Deep Learning  ",
        "Description": "Real-time Detection System for Face Masks and DeepFakes  ",
        "Category": "computer-vision  ",
        "Industry": "Security & Surveillance  ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "An AI-powered web application that combines face mask detection and deepfake video analysis with user authentication using Streamlit, OpenCV, and Keras",
        "Challenge": "Growing need for real-time identification of face mask usage and detection of synthetic media (deepfakes) for public health and digital security.  ",
        "Solution": "Integrated two deep learning models for image and video classification with secure login features, allowing users to analyze inputs via a clean Streamlit UI.",
        "Technologies": "Python, OpenCV, Keras, TensorFlow, InceptionV3, Streamlit",
        "DemoLink": "https://youtu.be/cA3aJT84o_s"
    },
    {
        "Title": "Online Payment Fraud Detection System ",
        "Description": "Real-Time Transaction Fraud Detection with Streamlit and KNN  ",
        "Category": "Deep Learning",
        "Industry": "Fintech & Cybersecurity  ",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A secure web app that uses a K-Nearest Neighbors (KNN) model to predict fraudulent online transactions with real-time alerts and dynamic data visualizations.",
        "Challenge": "Increasing volume of online transactions leading to higher risks of fraudulent payments, requiring accurate and real-time detection systems.  ",
        "Solution": "Built an interactive Streamlit interface featuring secure authentication, real-time fraud classification, transaction analysis visuals, and audio alerts for high-risk transactions.",
        "Technologies": "Python, Streamlit, Scikit-learn, Matplotlib, Seaborn, Pandas ",
        "DemoLink": "https://youtu.be/AyHQ8tly50c"
    },
    {
        "Title": "Bank Direct Marketing Prediction using AI | XGBoost Model with Streamlit",
        "Description": "Predict customer subscription to term deposits with a secure and interactive Streamlit web app powered by the XGBoost algorithm.",
        "Category": "Deep Learning-ai",
        "Industry": "Fintech & Marketing Analytics",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A smart web application that uses XGBoost to predict if a customer will subscribe to a bank’s term deposit, featuring real-time predictions, secure authentication, and visual insights.",
        "Challenge": "Financial institutions face difficulty in identifying the right target customers, making it essential to use predictive analytics for marketing effectiveness.",
        "Solution": "Built a user-friendly Streamlit app that performs secure login, accepts customer data input, processes it in real-time, and predicts subscription likelihood using a trained XGBoost model with rich data visualizations.",
        "Technologies": "Python, XGBoost, Streamlit, Scikit-learn, Pandas, Matplotlib, Seaborn",
        "DemoLink": "https://youtu.be/3HB3bVEwTBE"
    },
    {
        "Title": "🍏🥦 Food Stale Detection with Deep Learning | Streamlit & Live Camera | AI for Freshness Check",
        "Description": "A deep learning-powered web app that uses Streamlit and real-time camera input to determine the freshness of food items like apples and bananas through image classification.",
        "Category": "Deep Learning -ai",
        "Industry": "AgriTech & Food Safety",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A powerful deep learning-powered web app that uses Streamlit and real-time camera input to determine the freshness of food items like apples and bananas through image classification.",
        "Challenge": "Manual identification of stale food is unreliable and time-consuming, especially in large-scale food industries and retail.",
        "Solution": "Developed a deep learning model (via Teachable Machine & TensorFlow) integrated with a Streamlit app that allows users to either upload an image or use a live camera to instantly classify food items as fresh or stale.",
        "Technologies": "TensorFlow, Keras, OpenCV, Streamlit, NumPy, PIL",
        "DemoLink": "https://youtu.be/COcu863N4Wk"
    },
    {
        "Title": "🚔 Crime Prediction in Chicago | Streamlit & Machine Learning | Random Forest Model",
        "Description": "Predict crime rates in Chicago using a Random Forest Regressor integrated into a user-friendly Streamlit web application.",
        "Category": "crime-ai",
        "Industry": "Public Safety & Urban Analytics",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A machine learning-powered web app that forecasts crime counts in Chicago based on user inputs like district, community area, and time frame using Random Forest Regression",
        "Challenge": "Law enforcement agencies face difficulty in predicting crime patterns across locations and time periods, hindering preventive action and resource allocation.",
        "Solution": "Designed a predictive system using crime data from Chicago, combined with feature engineering and a Random Forest model, deployed via Streamlit for intuitive forecasting of future crime incidents",
        "Technologies": "Python, Scikit-learn, Streamlit, Pandas, NumPy",
        "DemoLink": "https://youtu.be/5EsELUKG1cM"
    },
    {
        "Title": "🏥 Hospital Management System | ReactJS",
        "Description": "A modern ReactJS-based hospital management web app featuring multilingual AI chatbot support, role-based access, and emergency service coordination.",
        "Category": "healthcare-tech",
        "Industry": "HealthTech & Medical Software",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A comprehensive hospital management system that streamlines patient communication, emergency response, and admin coordination using AI, real-time search, and a multilingual interface.",
        "Challenge": "Healthcare centers struggle with managing multilingual communication, patient search, emergency services, and role-based staff access efficiently.",
        "Solution": "Built a responsive and multilingual ReactJS platform integrated with Firebase and Node.js, featuring an AI chatbot, secure login for various roles, an admin panel, and real-time patient and ambulance service management.",
        "Technologies": "ReactJS, Firebase, Node.js, Context API, React Router, Tailwind CSS, Styled Components",
        "DemoLink": "https://youtu.be/Cfa_q3xOHhA"
    },
    {
        "Title": "🩺 AI-Powered Medical Chatbot | LSTM + NLP ",
        "Description": "A deep learning-based multilingual medical chatbot that understands user queries through text/voice",
        "Category": "health-nlp",
        "Industry": "Healthcare AI & Conversational Assistants",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "An intelligent medical chatbot built with LSTM, NLP, and LLMs (like Llama 2 via Ollama) to provide multilingual diagnosis and dynamic health solutions with visual aid using GIFs.",
        "Challenge": "Many users—especially in regional areas—lack access to reliable and language-inclusive medical guidance, limiting early diagnosis and timely intervention.",
        "Solution": "Developed a multilingual chatbot using deep learning (LSTM) and large language models that supports English, Telugu, and Tamil, enabling users to interact via voice or text and receive relevant, visually supported medical responses.",
        "Technologies": "LSTM, NLP, LLMs (Llama 2 via Ollama), Flask/Streamlit, Speech Recognition, Text-to-Speech, GIF Generation",
        "DemoLink": "https://youtu.be/OnRBqg93EiM"
    },
    {
        "Title": "Smart Farmer AI Assistant",
        "Description": "AI-Powered Agricultural Assistant with Flask and Deep Learning",
        "Category": "agri-tech-ai",
        "Industry": "Agriculture & AI",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A Flask-based intelligent web app offering crop recommendation, fertilizer prediction, water level estimation, and leaf disease detection using machine learning and deep learning.",
        "Challenge": "Farmers face challenges in optimizing crop yield, managing resources, and identifying plant diseases without expert assistance.",
        "Solution": "Developed a smart AI solution using ML and CNN models deployed in a Flask web app to guide farmers on crop choices, fertilizer use, irrigation needs, and disease diagnosis.",
        "Technologies": "Python, Flask, Random Forest, Decision Trees, TensorFlow, Keras, CNN, OpenCV",
        "DemoLink": "https://youtu.be/jANYn1GONQ8"
    },
    {
        "Title": "AI-Powered Deep Face Detection System",
        "Description": "Real-Time Face Recognition using MobileNet and LSTM in Streamlit",
        "Category": "vision-ai",
        "Industry": "Security & Surveillance",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "A real-time AI system combining CNN (MobileNet) and RNN (LSTM) to detect and recognize faces with high accuracy through a user-friendly Streamlit web interface.",
        "Challenge": "Traditional face recognition systems lack real-time efficiency, temporal consistency, and scalability in live environments.",
        "Solution": "Designed an intelligent deep learning model with MobileNet for fast feature extraction and LSTM for sequence analysis, enabling accurate and real-time facial recognition in surveillance and authentication setups.",
        "Technologies": "Python, MobileNet, LSTM, TensorFlow, Keras, OpenCV, Streamlit",
        "DemoLink": "https://youtu.be/3iybaE7sfBw"
    },
    {
        "Title": "AI-Powered WhatsApp Chat Analysis",
        "Description": "Sentiment Analysis, Chat Trends & Forecasting using Streamlit",
        "Category": "nlp-ai",
        "Industry": "Social Analytics & Data Science",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "An AI-driven Streamlit app that analyzes WhatsApp chat data to reveal message trends, user activity, sentiments, and predicts future chat behavior with ARIMA.",
        "Challenge": "Extracting meaningful insights from unstructured chat logs to understand communication patterns, emotional tones, and user engagement.",
        "Solution": "Built a complete analytics pipeline featuring sentiment detection, forecasting with ARIMA, word clouds, and emoji sentiment breakdown, all wrapped in an interactive UI",
        "Technologies": "Python, Streamlit, Pandas, NLTK, Seaborn, ARIMA, WordCloud, Emoji Analysis",
        "DemoLink": "https://youtu.be/T-xakxYGsr8"
    },
    {
        "Title": "AI-Based Petition Management System",
        "Description": "Grievance Redressal Automation using BERT and SVM",
        "Category": "nlp-governance-ai",
        "Industry": "Public Administration & AI Automation",
        "Thumbnail": "https://images.pexels.com/photos/415829/pexels-photo-415829.jpeg  ",
        "Description.1": "An intelligent petition processing system that uses NLP models like BERT and SVM to classify, prioritize, and route grievances for efficient and transparent redressal.",
        "Challenge": "Manual petition handling is slow, error-prone, and lacks transparency, making it difficult to address public concerns promptly.",
        "Solution": "Developed an AI solution that auto-classifies petitions by department, flags emergencies, detects repetitions, sends resolution reminders, and updates users in real-time.",
        "Technologies": "Python, BERT, SVM, NLP, Scikit-learn, Transformers, Streamlit",
        "DemoLink": "https://youtu.be/jnAWjARNjyo"
    }
]